# Задание 1.
# Найти предельные вероятности для системы S при λ01 = 1, λ02 = 2, λ10 = 2, λ13 = 2, λ20 = 3, λ23 = 1, λ31 = 3, λ32 = 2.
# Система уравнений имеет вид:

# (λ01 + λ02)p0 = λ10p1 + λ20p2,
# (λ10 + λ13)p1 = λ01p0 + λ31p3,
# (λ20 + λ23)p2 = λ02p0 + λ32p3,
# (λ31 + λ32)p3 = λ13p1 + λ23p2.

from sympy import symbols, Eq, solve

# Сделал вывод условия для удобства
print("\nСистема уравнений имеет вид: \n\n(λ01 + λ02)p0 = λ10p1 + λ20p2,\n(λ10 + λ13)p1 = λ01p0 + λ31p3,\n(λ20 + λ23)p2 = λ02p0 + λ32p3,\n(λ31 + λ32)p3 = λ13p1 + λ23p2.")

values = list(map(int, input("\nВведите значения для λ01, λ02, λ10, λ13, λ20, λ23, λ31, λ32 через пробел: ").split()))

# Это тоже, для лучшего визуального восприятия 
print(f"{values[0]+values[1]}p0 = {values[2]}p1 + {values[4]}p2,\n{values[2]+values[3]}p1 = {values[0]}p0 + {values[6]}p3,\n{values[4]+values[5]}p2 = {values[1]}p0 + {values[7]}p3,\np0 + p1 + p2 + p3 = 1.\n")

